Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sf_cfg.c
/**
 ******************************************************************************
 * @file    bl702_sf_cfg.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_sf_cfg.h"
#include "bl702_glb.h"
#include "bl702_xip_sflash.h"
#include "softcrc.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  SF_CFG
 *  @{
 */

/** @defgroup  SF_CFG_Private_Macros
 *  @{
 */
#define BFLB_FLASH_CFG_MAGIC "FCFG"

/*@} end of group SF_CFG_Private_Macros */

/** @defgroup  SF_CFG_Private_Types
 *  @{
 */
#ifndef BFLB_USE_ROM_DRIVER
typedef struct {
  uint32_t                  jedecID;
  char                     *name;
  const SPI_Flash_Cfg_Type *cfg;
} Flash_Info_t;
#endif

/*@} end of group SF_CFG_Private_Types */

/** @defgroup  SF_CFG_Private_Variables
 *  @{
 */
#ifndef BFLB_USE_ROM_DRIVER
static const ATTR_TCM_CONST_SECTION SPI_Flash_Cfg_Type flashCfg_Winb_80DV = {
    .resetCreadCmd     = 0xff,
    .resetCreadCmdSize = 3,
    .mid               = 0xef,

    .deBurstWrapCmd       = 0x77,
    .deBurstWrapCmdDmyClk = 0x3,
    .deBurstWrapDataMode  = SF_CTRL_DATA_4_LINES,
    .deBurstWrapData      = 0xF0,

    /*reg*/
    .writeEnableCmd     = 0x06,
    .wrEnableIndex      = 0x00,
    .wrEnableBit        = 0x01,
    .wrEnableReadRegLen = 0x01,

    .qeIndex       = 1,
    .qeBit         = 0x01,
    .qeWriteRegLen = 0x02,
    .qeReadRegLen  = 0x1,

    .busyIndex        = 0,
    .busyBit          = 0x00,
    .busyReadRegLen   = 0x1,
    .releasePowerDown = 0xab,

    .readRegCmd[0]  = 0x05,
    .readRegCmd[1]  = 0x35,
    .writeRegCmd[0] = 0x01,
    .writeRegCmd[1] = 0x01,

    .fastReadQioCmd = 0xeb,
    .frQioDmyClk    = 16 / 8,
    .cReadSupport   = 0,
    .cReadMode      = 0xFF,

    .burstWrapCmd       = 0x77,
    .burstWrapCmdDmyClk = 0x3,
    .burstWrapDataMode  = SF_CTRL_DATA_4_LINES,
    .burstWrapData      = 0x40,
    /*erase*/
    .chipEraseCmd   = 0xc7,
    .sectorEraseCmd = 0x20,
    .blk32EraseCmd  = 0x52,
    .blk64EraseCmd  = 0xd8,
    /*write*/
    .pageProgramCmd  = 0x02,
    .qpageProgramCmd = 0x32,
    .qppAddrMode     = SF_CTRL_ADDR_1_LINE,

    .ioMode    = SF_CTRL_QIO_MODE,
    .clkDelay  = 1,
    .clkInvert = 0x3d,

    .resetEnCmd          = 0x66,
    .resetCmd            = 0x99,
    .cRExit              = 0xff,
    .wrEnableWriteRegLen = 0x00,

    /*id*/
    .jedecIdCmd          = 0x9f,
    .jedecIdCmdDmyClk    = 0,
    .qpiJedecIdCmd       = 0x9f,
    .qpiJedecIdCmdDmyClk = 0x00,
    .sectorSize          = 4,
    .pageSize            = 256,

    /*read*/
    .fastReadCmd    = 0x0b,
    .frDmyClk       = 8 / 8,
    .qpiFastReadCmd = 0x0b,
    .qpiFrDmyClk    = 8 / 8,
    .fastReadDoCmd  = 0x3b,
    .frDoDmyClk     = 8 / 8,
    .fastReadDioCmd = 0xbb,
    .frDioDmyClk    = 0,
    .fastReadQoCmd  = 0x6b,
    .frQoDmyClk     = 8 / 8,

    .qpiFastReadQioCmd  = 0xeb,
    .qpiFrQioDmyClk     = 16 / 8,
    .qpiPageProgramCmd  = 0x02,
    .writeVregEnableCmd = 0x50,

    /* qpi mode */
    .enterQpi = 0x38,
    .exitQpi  = 0xff,

    /*AC*/
    .timeEsector = 300,
    .timeE32k    = 1200,
    .timeE64k    = 1200,
    .timePagePgm = 5,
    .timeCe      = 20 * 1000,
    .pdDelay     = 3,
    .qeData      = 0,
};

static const ATTR_TCM_CONST_SECTION SPI_Flash_Cfg_Type flashCfg_Winb_16DV = {
    .resetCreadCmd     = 0xff,
    .resetCreadCmdSize = 3,
    .mid               = 0xef,

    .deBurstWrapCmd       = 0x77,
    .deBurstWrapCmdDmyClk = 0x3,
    .deBurstWrapDataMode  = SF_CTRL_DATA_4_LINES,
    .deBurstWrapData      = 0xF0,

    /*reg*/
    .writeEnableCmd     = 0x06,
    .wrEnableIndex      = 0x00,
    .wrEnableBit        = 0x01,
    .wrEnableReadRegLen = 0x01,

    .qeIndex       = 1,
    .qeBit         = 0x01,
    .qeWriteRegLen = 0x02, /*Q08BV,Q16DV: 0x02.Q32FW,Q32FV: 0x01 */
    .qeReadRegLen  = 0x1,

    .busyIndex        = 0,
    .busyBit          = 0x00,
    .busyReadRegLen   = 0x1,
    .releasePowerDown = 0xab,

    .readRegCmd[0]  = 0x05,
    .readRegCmd[1]  = 0x35,
    .writeRegCmd[0] = 0x01,
    .writeRegCmd[1] = 0x01,

    .fastReadQioCmd = 0xeb,
    .frQioDmyClk    = 16 / 8,
    .cReadSupport   = 1,
    .cReadMode      = 0x20,

    .burstWrapCmd       = 0x77,
    .burstWrapCmdDmyClk = 0x3,
    .burstWrapDataMode  = SF_CTRL_DATA_4_LINES,
    .burstWrapData      = 0x40,
    /*erase*/
    .chipEraseCmd   = 0xc7,
    .sectorEraseCmd = 0x20,
    .blk32EraseCmd  = 0x52,
    .blk64EraseCmd  = 0xd8,
    /*write*/
    .pageProgramCmd  = 0x02,
    .qpageProgramCmd = 0x32,
    .qppAddrMode     = SF_CTRL_ADDR_1_LINE,

