Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sf_cfg.c
/** @defgroup  SF_CFG_Private_Fun_Declaration
 *  @{
 */

/*@} end of group SF_CFG_Private_Fun_Declaration */

/** @defgroup  SF_CFG_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  Init external flash GPIO according to flash GPIO config
                                                                                *
                                                                                * @param  extFlashPin: Flash GPIO config
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
/* static */ void ATTR_TCM_SECTION SF_Cfg_Init_Ext_Flash_Gpio(uint8_t extFlashPin) {
  GLB_GPIO_Cfg_Type cfg;
  uint8_t           gpiopins[6];
  uint8_t           i = 0;

  cfg.gpioMode = GPIO_MODE_AF;
  cfg.pullType = GPIO_PULL_UP;
  cfg.drive    = 1;
  cfg.smtCtrl  = 1;
  cfg.gpioFun  = GPIO_FUN_FLASH_PSRAM;

  if (extFlashPin == 0) {
    gpiopins[0] = BFLB_EXTFLASH_CLK0_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS0_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA00_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA10_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA20_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA30_GPIO;
  } else if (extFlashPin == 1) {
    gpiopins[0] = BFLB_EXTFLASH_CLK1_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS1_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA01_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA11_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA21_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA31_GPIO;
  } else {
    gpiopins[0] = BFLB_EXTFLASH_CLK2_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS2_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA02_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA12_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA22_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA32_GPIO;
  }

  for (i = 0; i < sizeof(gpiopins); i++) {
    cfg.gpioPin = gpiopins[i];

    if (i == 0 || i == 1) {
      /*flash clk and cs is output*/
      cfg.gpioMode = GPIO_MODE_OUTPUT;
    } else {
      /*data are bidir*/
      cfg.gpioMode = GPIO_MODE_AF;
    }

    GLB_GPIO_Init(&cfg);
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Deinit external flash GPIO according to flash GPIO config
                                                                                *
                                                                                * @param  extFlashPin: Flash GPIO config
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
/* static */ void ATTR_TCM_SECTION SF_Cfg_Deinit_Ext_Flash_Gpio(uint8_t extFlashPin) {
  GLB_GPIO_Cfg_Type cfg;
  uint8_t           gpiopins[6];
  uint8_t           i = 0;

  cfg.gpioMode = GPIO_MODE_INPUT;
  cfg.pullType = GPIO_PULL_UP;
  cfg.drive    = 1;
  cfg.smtCtrl  = 1;
  cfg.gpioFun  = GPIO_FUN_GPIO;

  if (extFlashPin == 0) {
    gpiopins[0] = BFLB_EXTFLASH_CLK0_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS0_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA00_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA10_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA20_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA30_GPIO;

  } else if (extFlashPin == 1) {
    gpiopins[0] = BFLB_EXTFLASH_CLK1_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS1_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA01_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA11_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA21_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA31_GPIO;
  } else {
    gpiopins[0] = BFLB_EXTFLASH_CLK2_GPIO;
    gpiopins[1] = BFLB_EXTFLASH_CS2_GPIO;
    gpiopins[2] = BFLB_EXTFLASH_DATA02_GPIO;
    gpiopins[3] = BFLB_EXTFLASH_DATA12_GPIO;
    gpiopins[4] = BFLB_EXTFLASH_DATA22_GPIO;
    gpiopins[5] = BFLB_EXTFLASH_DATA32_GPIO;
  }

  for (i = 0; i < sizeof(gpiopins); i++) {
    cfg.gpioPin = gpiopins[i];
    GLB_GPIO_Init(&cfg);
  }
}
#endif

/*@} end of group SF_CFG_Private_Functions */

/** @defgroup  SF_CFG_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  Get flash config according to flash ID
                                                                                *
                                                                                * @param  flashID: Flash ID
                                                                                * @param  pFlashCfg: Flash config pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SF_Cfg_Get_Flash_Cfg_Need_Lock(uint32_t flashID, SPI_Flash_Cfg_Type *pFlashCfg) {
  uint32_t i;
  uint8_t  buf[sizeof(SPI_Flash_Cfg_Type) + 8];
  uint32_t crc, *pCrc;
  uint32_t xipOffset;

  if (flashID == 0) {
    xipOffset = SF_Ctrl_Get_Flash_Image_Offset();
    SF_Ctrl_Set_Flash_Image_Offset(0);
    XIP_SFlash_Read_Via_Cache_Need_Lock(8 + BL702_FLASH_XIP_BASE, buf, sizeof(SPI_Flash_Cfg_Type) + 8);
    SF_Ctrl_Set_Flash_Image_Offset(xipOffset);

    if (BL702_MemCmp(buf, BFLB_FLASH_CFG_MAGIC, 4) == 0) {
      crc  = BFLB_Soft_CRC32((uint8_t *)buf + 4, sizeof(SPI_Flash_Cfg_Type));
      pCrc = (uint32_t *)(buf + 4 + sizeof(SPI_Flash_Cfg_Type));

      if (*pCrc == crc) {
        BL702_MemCpy_Fast(pFlashCfg, (uint8_t *)buf + 4, sizeof(SPI_Flash_Cfg_Type));
        return SUCCESS;
      }
    }
  } else {
    for (i = 0; i < sizeof(flashInfos) / sizeof(flashInfos[0]); i++) {
      if (flashInfos[i].jedecID == flashID) {
        BL702_MemCpy_Fast(pFlashCfg, flashInfos[i].cfg, sizeof(SPI_Flash_Cfg_Type));
        return SUCCESS;
      }
    }
  }

