Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sf_cfg.c
  return ERROR;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Init flash GPIO according to flash Pin config
                                                                                *
                                                                                * @param  flashPinCfg: Specify flash Pin config
                                                                                * @param  restoreDefault: Wether to restore default setting
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
__WEAK
void ATTR_TCM_SECTION SF_Cfg_Init_Flash_Gpio(uint8_t flashPinCfg, uint8_t restoreDefault) {
  uint8_t  flashCfg;
  uint8_t  swapCfg;
  uint32_t tmpVal;

  flashCfg = (flashPinCfg >> 2) & 0x03;
  swapCfg  = flashPinCfg & 0x03;

  if (restoreDefault) {
    /* Set Default first */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_USE_PSRAM__IO);

    if (BL_GET_REG_BITS_VAL(tmpVal, GLB_CFG_GPIO_USE_PSRAM_IO) == 0x00) {
      SF_Cfg_Init_Ext_Flash_Gpio(1);
    }

    tmpVal = BL_RD_REG(GLB_BASE, GLB_PARM);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_CS_IO2);
    tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_IO0_IO3);
    BL_WR_REG(GLB_BASE, GLB_PARM, tmpVal);

    SF_Ctrl_Select_Pad(SF_CTRL_PAD_SEL_SF2);

    /* Default is set, so return */
    if (flashCfg == BFLB_FLASH_CFG_SF2_EXT_23_28 && swapCfg == BFLB_SF2_SWAP_NONE) {
      return;
    }
  }

  if (flashCfg == BFLB_FLASH_CFG_SF1_EXT_17_22) {
    SF_Cfg_Init_Ext_Flash_Gpio(0);
    SF_Ctrl_Select_Pad(SF_CTRL_PAD_SEL_SF1);
  } else {
    tmpVal = BL_RD_REG(GLB_BASE, GLB_GPIO_USE_PSRAM__IO);

    if (BL_GET_REG_BITS_VAL(tmpVal, GLB_CFG_GPIO_USE_PSRAM_IO) == 0x00) {
      SF_Cfg_Init_Ext_Flash_Gpio(1);
    }

    tmpVal = BL_RD_REG(GLB_BASE, GLB_PARM);

    if (swapCfg == BFLB_SF2_SWAP_NONE) {
      tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_CS_IO2);
      tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_IO0_IO3);
    } else if (swapCfg == BFLB_SF2_SWAP_CS_IO2) {
      tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_CS_IO2);
      tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_IO0_IO3);
    } else if (swapCfg == BFLB_SF2_SWAP_IO0_IO3) {
      tmpVal = BL_CLR_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_CS_IO2);
      tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_IO0_IO3);
    } else {
      tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_CS_IO2);
      tmpVal = BL_SET_REG_BIT(tmpVal, GLB_CFG_SFLASH2_SWAP_IO0_IO3);
    }

    BL_WR_REG(GLB_BASE, GLB_PARM, tmpVal);

    SF_Ctrl_Select_Pad(SF_CTRL_PAD_SEL_SF2);
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Identify one flash
                                                                                *
                                                                                * @param  callFromFlash: code run at flash or ram
                                                                                * @param  autoScan: Auto scan all GPIO pin
                                                                                * @param  flashPinCfg: Specify flash GPIO config, not auto scan
                                                                                * @param  restoreDefault: Wether restore default flash GPIO config
                                                                                * @param  pFlashCfg: Flash config pointer
                                                                                *
                                                                                * @return Flash ID
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint32_t ATTR_TCM_SECTION SF_Cfg_Flash_Identify(uint8_t callFromFlash, uint32_t autoScan, uint32_t flashPinCfg, uint8_t restoreDefault, SPI_Flash_Cfg_Type *pFlashCfg) {
  uint32_t    jdecId = 0;
  uint32_t    i      = 0;
  uint32_t    offset;
  BL_Err_Type stat;

  BL702_MemCpy_Fast(pFlashCfg, &flashCfg_Gd_Q80E_Q16E, sizeof(SPI_Flash_Cfg_Type));

  if (callFromFlash == 1) {
    stat = XIP_SFlash_State_Save(pFlashCfg, &offset);

    if (stat != SUCCESS) {
      SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);
      return 0;
    }
  }

  if (autoScan) {
    flashPinCfg = 0;

    do {
      if (flashPinCfg > 0x0f) {
        jdecId = 0;
        break;
      }

      SF_Cfg_Init_Flash_Gpio(flashPinCfg, restoreDefault);
      SFlash_Releae_Powerdown(pFlashCfg);
      SFlash_Reset_Continue_Read(pFlashCfg);
      SFlash_DisableBurstWrap(pFlashCfg);
      jdecId = 0;
      SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
      SFlash_DisableBurstWrap(pFlashCfg);
      jdecId = jdecId & 0xffffff;
      flashPinCfg++;
    } while ((jdecId & 0x00ffff) == 0 || (jdecId & 0xffff00) == 0 || (jdecId & 0x00ffff) == 0xffff || (jdecId & 0xffff00) == 0xffff00);
  } else {
    /* select media gpio */
    SF_Cfg_Init_Flash_Gpio(flashPinCfg, restoreDefault);
    SFlash_Releae_Powerdown(pFlashCfg);
    SFlash_Reset_Continue_Read(pFlashCfg);
    SFlash_DisableBurstWrap(pFlashCfg);
    SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
    SFlash_DisableBurstWrap(pFlashCfg);
    jdecId = jdecId & 0xffffff;
  }

  for (i = 0; i < sizeof(flashInfos) / sizeof(flashInfos[0]); i++) {
    if (flashInfos[i].jedecID == jdecId) {
      BL702_MemCpy_Fast(pFlashCfg, flashInfos[i].cfg, sizeof(SPI_Flash_Cfg_Type));
      break;
    }
  }

  if (i == sizeof(flashInfos) / sizeof(flashInfos[0])) {
    if (callFromFlash == 1) {
      XIP_SFlash_State_Restore(pFlashCfg, pFlashCfg->ioMode, offset);
    }

    return jdecId;
  } else {
    if (callFromFlash == 1) {
      XIP_SFlash_State_Restore(pFlashCfg, pFlashCfg->ioMode, offset);
    }

    return (jdecId | BFLB_FLASH_ID_VALID_FLAG);
  }
}
#endif

/*@} end of group SF_CFG_Public_Functions */

/*@} end of group SF_CFG */

/*@} end of group BL702_Peripheral_Driver */
